Tekla.Structures.Analysis.AnalysisBeamEnd
The AnalysisBeamEnd class contains information related to analysis beam ends.

Tekla.Structures.Analysis.AnalysisBeamEnd._Profile
The profile at the beam end.

Tekla.Structures.Analysis.AnalysisBeamEnd._Eccentricity
The Eccentricity at the beam end.

Tekla.Structures.Analysis.AnalysisBeamEnd._Connectivity
The connectivity at the beam end.

Tekla.Structures.Analysis.AnalysisBeamEnd.Profile
The profile at the beam end.

Tekla.Structures.Analysis.AnalysisBeamEnd.Eccentricity
The eccentricity at the beam end (in the member's local coordinate system).

Tekla.Structures.Analysis.AnalysisBeamEnd.Connectivity
The connectivity at the beam end.